Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# diagnostics.operation.refreshSemanticIndex
source: refreshing semantic index
ar: تحديث الفهرس الدلالي
de: Semantischen Index aktualisieren
es: actualizando índice semántico
fr: Actualisation de l'index sémantique
id: menyegarkan indeks semantik
it: Aggiornamento indice semantico
ja: セマンティックインデックスを更新中
ko: 시맨틱 인덱스 새로고침
nl: Semantische index vernieuwen
pl: odświeżanie indeksu semantycznego
pt_br: atualizando índice semântico
ru: обновление семантического индекса
tr: anlamsal dizin yenileniyor
uk: оновлення семантичного індексу
vi: Đang làm mới chỉ mục ngữ nghĩa
zh_hans: 刷新语义索引
zh_hant: 刷新语义索引

# diagnostics.operation.startup
source: starting Starcat
ar: بدء Starcat
de: Starcat starten
es: iniciando Starcat
fr: Démarrage de Starcat
id: memulai Starcat
it: Avvio di Starcat
ja: Starcatを起動中
ko: Starcat 시작
nl: Starcat starten
pl: uruchamianie Starcat
pt_br: iniciando o Starcat
ru: запуск Starcat
tr: Starcat başlatılıyor
uk: запуск Starcat
vi: Đang khởi động Starcat
zh_hans: 启动 Starcat
zh_hant: 启动 Starcat

# diagnostics.operation.syncStars
source: syncing GitHub stars
ar: مزامنة نجوم GitHub
de: GitHub-Stars synchronisieren
es: sincronizando estrellas de GitHub
fr: Synchronisation des favoris GitHub
id: menyinkronkan bintang GitHub
it: Sincronizzazione stelle GitHub
ja: GitHubスターを同期中
ko: GitHub 별 동기화
nl: GitHub-sterren synchroniseren
pl: synchronizacja gwiazdek GitHub
pt_br: sincronizando favoritos do GitHub
ru: синхронизация звёзд GitHub
tr: GitHub yıldızları senkronize ediliyor
uk: синхронізація зірок GitHub
vi: Đang đồng bộ sao GitHub
zh_hans: 同步 GitHub Stars
zh_hant: 同步 GitHub Stars

# diagnostics.operation.translateReadme
source: translating README
ar: ترجمة README
de: README übersetzen
es: traduciendo README
fr: Traduction du README
id: menerjemahkan README
it: Traduzione README
ja: READMEを翻訳中
ko: README 번역
nl: README vertalen
pl: tłumaczenie README
pt_br: traduzindo README
ru: перевод README
tr: README çevriliyor
uk: переклад README
vi: Đang dịch README
zh_hans: 翻译 README
zh_hant: 翻译 README

# diagnostics.quit
source: Quit Starcat
ar: إنهاء Starcat
de: Starcat beenden
es: Salir de Starcat
fr: Quitter Starcat
id: Keluar dari Starcat
it: Esci da Starcat
ja: Starcatを終了
ko: Starcat 종료
nl: Starcat afsluiten
pl: Zakończ Starcat
pt_br: Sair do Starcat
ru: Закрыть Starcat
tr: Starcat'tan Çık
uk: Завершити Starcat
vi: Thoát Starcat
zh_hans: 退出 Starcat
zh_hant: 退出 Starcat

# empty.allTagged
source: No untagged repos
ar: لا توجد مستودعات غير موسومة
de: Keine unmarkierten Repos
es: No hay repos sin etiqueta
fr: Aucun dépôt non étiqueté
id: Tidak ada repositori tanpa tag
it: Nessun repo senza tag
ja: タグなしリポジトリはありません
ko: 태그 없는 저장소 없음
nl: Geen ongetagde repos
pl: Brak repozytoriów bez tagów
pt_br: Nenhum repositório sem etiqueta
ru: Нет репозиториев без тегов
tr: Etiketsiz depo yok
uk: Немає репозиторіїв без тегів
vi: Không có repo chưa gắn thẻ
zh_hans: 暂无未分类仓库
zh_hant: 暂无未分类仓库

# empty.languageHint
source: Try refreshing or syncing again.
ar: جرّب التحديث أو المزامنة مرة أخرى.
de: Versuchen Sie es erneut mit Aktualisieren oder Synchronisieren.
es: Intenta refrescar o sincronizar de nuevo.
fr: Essayez d'actualiser ou de synchroniser à nouveau.
id: Coba segarkan atau sinkronkan lagi.
it: Prova ad aggiornare o sincronizzare di nuovo.
ja: 再度更新または同期してみてください。
ko: 다시 새로고침하거나 동기화해 보세요.
nl: Probeer opnieuw te verversen of te synchroniseren.
pl: Spróbuj odświeżyć lub zsynchronizować ponownie.
pt_br: Tente atualizar ou sincronizar novamente.
ru: Попробуйте обновить или синхронизировать снова.
tr: Tekrar yenilemeyi veya senkronize etmeyi deneyin.
uk: Спробуйте оновити або синхронізувати ще раз.
vi: Hãy thử làm mới hoặc đồng bộ lại.
zh_hans: 刷新或同步后再试试。
zh_hant: 刷新或同步后再试试。

# empty.library.subtitle
source: Click the heart button in a repo detail view to add it to your library.
ar: انقر على زر القلب في عرض تفاصيل المستودع لإضافته إلى مكتبتك.
de: Klicken Sie in der Repo-Detailansicht auf das Herz-Symbol, um es Ihrer Bibliothek hinzuzufügen.
es: Haz clic en el botón de corazón en la vista de detalle de un repo para añadirlo a tu biblioteca.
fr: Cliquez sur le bouton cœur dans la vue détaillée d'un dépôt pour l'ajouter à votre bibliothèque.
id: Klik tombol hati di tampilan detail repositori untuk menambahkannya ke perpustakaan Anda.
it: Fai clic sul pulsante cuore nella vista dettaglio di un repo per aggiungerlo alla tua libreria.
ja: リポジトリ詳細でハートボタンをクリックするとライブラリに追加されます。
ko: 저장소 상세 보기에서 하트 버튼을 클릭하여 라이브러리에 추가하세요.
nl: Klik op de hartknop in een repo-detailweergave om deze aan je bibliotheek toe te voegen.
pl: Kliknij przycisk serca w widoku szczegółów repozytorium, aby dodać je do biblioteki.
pt_br: Clique no botão de coração na visualização de detalhes do repositório para adicioná-lo à sua biblioteca.
ru: Нажмите кнопку сердечка в карточке репозитория, чтобы добавить его в библиотеку.
tr: Kütüphanenize eklemek için bir depo detay görünümünde kalp düğmesine tıklayın.
uk: Натисніть кнопку серця у детальному перегляді репозиторію, щоб додати його до бібліотеки.
vi: Nhấp vào nút trái tim trong chế độ xem chi tiết repo để thêm vào thư viện của bạn.
zh_hans: 点击仓库详情中的心形按钮,将仓库加入知识库。
zh_hant: 点击仓库详情中的心形按钮,将仓库加入知识库。

# empty.library.title
source: Library is empty
ar: المكتبة فارغة
de: Bibliothek ist leer
es: La biblioteca está vacía
fr: La bibliothèque est vide
id: Perpustakaan kosong
it: La libreria è vuota
ja: ライブラリは空です
ko: 라이브러리가 비어 있음
nl: Bibliotheek is leeg
pl: Biblioteka jest pusta
pt_br: A biblioteca está vazia
ru: Библиотека пуста
tr: Kütüphane boş
uk: Бібліотека порожня
vi: Thư viện trống
zh_hans: 知识库为空
zh_hant: 知识库为空

# empty.loadingStars.subtitle
source: Starcat is fetching your GitHub Stars. Repositories will appear as soon as the first page is saved.
ar: يقوم Starcat بجلب نجوم GitHub الخاصة بك. ستظهر المستودعات بمجرد حفظ الصفحة الأولى.
de: Starcat ruft Ihre GitHub-Stars ab. Repositories erscheinen, sobald die erste Seite gespeichert ist.
es: Starcat está obteniendo tus estrellas de GitHub. Los repositorios aparecerán en cuanto se guarde la primera página.
fr: Starcat récupère vos étoiles GitHub. Les dépôts apparaîtront dès que la première page sera enregistrée.
id: Starcat sedang mengambil GitHub Stars Anda. Repositori akan muncul segera setelah halaman pertama disimpan.
it: Starcat sta recuperando le tue stelle GitHub. I repository appariranno non appena la prima pagina sarà salvata.
ja: StarcatがGitHubスターを取得しています。最初のページが保存されるとリポジトリが表示されます。
ko: Starcat이 GitHub Star를 가져오는 중입니다. 첫 페이지가 저장되면 저장소가 나타납니다.
nl: Starcat haalt je GitHub-sterren op. Repositories verschijnen zodra de eerste pagina is opgeslagen.
pl: Starcat pobiera Twoje gwiazdki z GitHub. Repozytoria pojawią się, gdy pierwsza strona zostanie zapisana.
pt_br: O Starcat está buscando seus Stars do GitHub. Os repositórios aparecerão assim que a primeira página for salva.
ru: Starcat загружает ваши звёзды с GitHub. Репозитории появятся, как только будет сохранена первая страница.
tr: Starcat, GitHub Yıldızlarınızı getiriyor. İlk sayfa kaydedildiğinde depolar görünecektir.
uk: Starcat отримує ваші зірки GitHub. Репозиторії з'являться, щойно буде збережено першу сторінку.
vi: Starcat đang tải GitHub Stars của bạn. Các kho lưu trữ sẽ xuất hiện ngay khi trang đầu tiên được lưu.
zh_hans: Starcat 正在拉取你的 GitHub Stars，首批仓库写入后会自动显示。
zh_hant: Starcat 正在拉取你的 GitHub Stars，首批仓库写入后会自动显示。

# empty.loadingStars.title
source: Loading Stars…
ar: جارٍ تحميل النجوم…
de: Stars werden geladen…
es: Cargando estrellas…
fr: Chargement des étoiles…
id: Memuat Stars…
it: Caricamento stelle…
ja: スターを読み込み中…
ko: Star 로딩 중…
nl: Sterren laden…
pl: Ładowanie gwiazdek…
pt_br: Carregando Stars…
ru: Загрузка звёзд…
tr: Yıldızlar Yükleniyor…
uk: Завантаження зірок…
vi: Đang tải Stars…
zh_hans: 正在加载 Stars…
zh_hant: 正在加载 Stars…

# empty.noReposInLanguage
source: No repos in this language
ar: لا توجد مستودعات بهذه اللغة
de: Keine Repos in dieser Sprache
es: No hay repos en este lenguaje
fr: Aucun dépôt dans cette langue
id: Tidak ada repositori dalam bahasa ini
it: Nessun repo in questa lingua
ja: この言語のリポジトリはありません
ko: 이 언어의 저장소 없음
nl: Geen repos in deze taal
pl: Brak repozytoriów w tym języku
pt_br: Nenhum repositório neste idioma
ru: Нет репозиториев на этом языке
tr: Bu dilde depo yok
uk: Немає репозиторіїв цією мовою
vi: Không có repo bằng ngôn ngữ này
zh_hans: 该语言下暂无仓库
zh_hant: 该语言下暂无仓库

# empty.noReposInTag
source: No repos with this tag
ar: لا توجد مستودعات بهذا الوسم
de: Keine Repos mit diesem Tag
es: No hay repos con esta etiqueta
fr: Aucun dépôt avec cette étiquette
id: Tidak ada repositori dengan tag ini
it: Nessun repo con questo tag
ja: このタグのリポジトリはありません
ko: 이 태그의 저장소 없음
nl: Geen repos met deze tag
pl: Brak repozytoriów z tym tagiem
pt_br: Nenhum repositório com esta etiqueta
ru: Нет репозиториев с этим тегом
tr: Bu etikete sahip depo yok
uk: Немає репозиторіїв з цим тегом
vi: Không có repo với thẻ này
zh_hans: 该标签下暂无仓库
zh_hant: 该标签下暂无仓库

# empty.noResults
source: No Results
ar: لا توجد نتائج
de: Keine Ergebnisse
es: Sin resultados
fr: Aucun résultat
id: Tidak Ada Hasil
it: Nessun risultato
ja: 結果なし
ko: 검색 결과 없음
nl: Geen resultaten
pl: Brak wyników
pt_br: Nenhum resultado
ru: Нет результатов
tr: Sonuç Yok
uk: Немає результатів
vi: Không có kết quả
zh_hans: 无匹配结果
zh_hant: 无匹配结果

# empty.noSelection
source: No Repo Selected
ar: لم يتم تحديد مستودع
de: Kein Repo ausgewählt
es: Ningún repo seleccionado
fr: Aucun dépôt sélectionné
id: Tidak Ada Repositori Dipilih
it: Nessun repo selezionato
ja: リポジトリが選択されていません
ko: 선택한 저장소 없음
nl: Geen repo geselecteerd
pl: Nie wybrano repozytorium
pt_br: Nenhum repositório selecionado
ru: Репозиторий не выбран
tr: Depo Seçilmedi
uk: Репозиторій не вибрано
vi: Chưa chọn repo
zh_hans: 未选中仓库
zh_hant: 未选中仓库

# empty.noStars
source: No Stars Yet
ar: لا توجد نجوم بعد
de: Noch keine Stars
es: Aún sin estrellas
fr: Pas encore d'étoiles
id: Belum Ada Stars
it: Ancora nessuna stella
ja: まだスターはありません
ko: 아직 Star 없음
nl: Nog geen sterren
pl: Brak gwiazdek
pt_br: Nenhum Star ainda
ru: Пока нет звёзд
tr: Henüz Yıldız Yok
uk: Ще немає зірок
vi: Chưa có Star nào
zh_hans: 还没有 Stars
zh_hant: 还没有 Stars

# empty.selectFromList
source: Select a repo from the list on the left
ar: حدد مستودعًا من القائمة على اليسار
de: Wählen Sie ein Repo aus der Liste links aus
es: Selecciona un repo de la lista de la izquierda
fr: Sélectionnez un dépôt dans la liste de gauche
id: Pilih repositori dari daftar di sebelah kiri
it: Seleziona un repo dall'elenco a sinistra
ja: 左のリストからリポジトリを選択してください
ko: 왼쪽 목록에서 저장소를 선택하세요
nl: Selecteer een repo uit de lijst aan de linkerkant
pl: Wybierz repozytorium z listy po lewej stronie
pt_br: Selecione um repositório da lista à esquerda
ru: Выберите репозиторий из списка слева
tr: Soldaki listeden bir depo seçin
uk: Виберіть репозиторій зі списку ліворуч
vi: Chọn một repo từ danh sách bên trái
zh_hans: 从左侧列表选择一个查看详情
zh_hant: 从左侧列表选择一个查看详情

# empty.syncPrompt
source: Click the sync button in the sidebar to fetch GitHub Stars
ar: انقر على زر المزامنة في الشريط الجانبي لجلب نجوم GitHub
de: Klicken Sie in der Seitenleiste auf das Synchronisieren-Symbol, um GitHub-Stars abzurufen
es: Haz clic en el botón de sincronización en la barra lateral para obtener las estrellas de GitHub
fr: Cliquez sur le bouton de synchronisation dans la barre latérale pour récupérer les étoiles GitHub
id: Klik tombol sinkronisasi di bilah samping untuk mengambil GitHub Stars
it: Fai clic sul pulsante di sincronizzazione nella barra laterale per recuperare le stelle GitHub
ja: サイドバーの同期ボタンをクリックしてGitHubスターを取得してください
ko: 사이드바의 동기화 버튼을 클릭하여 GitHub Star를 가져오세요
nl: Klik op de synchronisatieknop in de zijbalk om GitHub-sterren op te halen
pl: Kliknij przycisk synchronizacji na pasku bocznym, aby pobrać gwiazdki z GitHub
pt_br: Clique no botão de sincronização na barra lateral para buscar Stars do GitHub
ru: Нажмите кнопку синхронизации на боковой панели, чтобы загрузить звёзды с GitHub
tr: GitHub Yıldızlarını getirmek için kenar çubuğundaki senkronizasyon düğmesine tıklayın
uk: Натисніть кнопку синхронізації на бічній панелі, щоб отримати зірки GitHub
vi: Nhấp vào nút đồng bộ trong thanh bên để tải GitHub Stars
zh_hans: 点击侧边栏同步按钮拉取 GitHub Stars
zh_hant: 点击侧边栏同步按钮拉取 GitHub Stars

# empty.tagHint
source: Add this tag from a repo detail page.
ar: أضف هذا الوسم من صفحة تفاصيل المستودع.
de: Fügen Sie diesen Tag auf der Repo-Detailseite hinzu.
es: Añade esta etiqueta desde la página de detalle de un repo.
fr: Ajoutez cette étiquette depuis la page de détail d'un dépôt.
id: Tambahkan tag ini dari halaman detail repositori.
it: Aggiungi questo tag dalla pagina dettaglio di un repo.
ja: リポジトリ詳細ページからこのタグを追加できます。
ko: 저장소 상세 페이지에서 이 태그를 추가하세요.
nl: Voeg deze tag toe vanaf een repo-detailpagina.
pl: Dodaj ten tag ze strony szczegółów repozytorium.
pt_br: Adicione esta etiqueta a partir da página de detalhes do repositório.
ru: Добавьте этот тег на странице репозитория.
tr: Bu etiketi bir depo detay sayfasından ekleyin.
uk: Додайте цей тег зі сторінки деталей репозиторію.
vi: Thêm thẻ này từ trang chi tiết repo.
zh_hans: 在仓库详情页给它打上该标签。
zh_hant: 在仓库详情页给它打上该标签。

# empty.trendingComingSoon
source: Try again later
ar: قريبًا
de: Demnächst verfügbar
es: Próximamente
fr: Bientôt disponible
id: Segera hadir
it: Prossimamente
ja: 近日公開
ko: 곧 제공
nl: Binnenkort beschikbaar
pl: Wkrótce
pt_br: Em breve
ru: Скоро
tr: Çok yakında
uk: Незабаром
vi: Sắp ra mắt
zh_hans: 请稍后重试
zh_hant: 請稍後重試

# empty.trendingUnavailable
source: No Trending data yet
ar: بيانات الشائع غير متاحة
de: Trenddaten nicht verfügbar
es: Datos de tendencias no disponibles
fr: Données tendances indisponibles
id: Data tren tidak tersedia
it: Dati di tendenza non disponibili
ja: トレンドデータを利用できません
ko: 트렌드 데이터를 사용할 수 없음
nl: Trending-gegevens niet beschikbaar
pl: Dane trendów niedostępne
pt_br: Dados de tendências indisponíveis
ru: Данные о трендах недоступны
tr: Trend verileri kullanılamıyor
uk: Дані про тренди недоступні
vi: Dữ liệu thịnh hành không khả dụng
zh_hans: 暂无 Trending 数据
zh_hant: 暫無 Trending 數據

# empty.tryAnother
source: Try a different search term
ar: جرّب مصطلح بحث مختلف
de: Versuchen Sie einen anderen Suchbegriff
es: Prueba con otro término de búsqueda
fr: Essayez un autre terme de recherche
id: Coba istilah pencarian lain
it: Prova un termine di ricerca diverso
ja: 別の検索語をお試しください
ko: 다른 검색어를 시도해 보세요
nl: Probeer een andere zoekterm
pl: Spróbuj innego wyszukiwanego hasła
pt_br: Tente um termo de pesquisa diferente
ru: Попробуйте другой поисковый запрос
tr: Farklı bir arama terimi deneyin
uk: Спробуйте інший пошуковий запит
vi: Thử một cụm từ tìm kiếm khác
zh_hans: 试试别的关键词
zh_hant: 试试别的关键词

# empty.untaggedHint
source: Untagged Stars will appear here once syncing completes.
ar: ستظهر النجوم غير الموسومة هنا بمجرد اكتمال المزامنة.
de: Unmarkierte Stars erscheinen hier, sobald die Synchronisierung abgeschlossen ist.
es: Las estrellas sin etiqueta aparecerán aquí una vez que se complete la sincronización.
fr: Les étoiles non étiquetées apparaîtront ici une fois la synchronisation terminée.
id: Stars tanpa tag akan muncul di sini setelah sinkronisasi selesai.
it: Le stelle senza tag appariranno qui una volta completata la sincronizzazione.
ja: 同期が完了すると、タグなしスターがここに表示されます。
ko: 동기화가 완료되면 태그 없는 Star가 여기에 나타납니다.
nl: Ongetagde sterren verschijnen hier zodra de synchronisatie is voltooid.
pl: Nieotagowane gwiazdki pojawią się tutaj po zakończeniu synchronizacji.
pt_br: Stars sem etiqueta aparecerão aqui após a conclusão da sincronização.
ru: Звёзды без тегов появятся здесь после завершения синхронизации.
tr: Senkronizasyon tamamlandığında etiketsiz yıldızlar burada görünecektir.
uk: Зірки без тегів з'являться тут після завершення синхронізації.
vi: Các Star chưa gắn thẻ sẽ xuất hiện ở đây sau khi đồng bộ hoàn tất.
zh_hans: 同步完成后未打标的 Stars 会出现在这里
zh_hant: 同步完成后未打标的 Stars 会出现在这里

# error.loadFailed
source: Load Failed
ar: فشل التحميل
de: Laden fehlgeschlagen
es: Error al cargar
fr: Échec du chargement
id: Gagal Memuat
it: Caricamento fallito
ja: 読み込みに失敗
ko: 로드 실패
nl: Laden mislukt
pl: Wczytywanie nie powiodło się
pt_br: Falha ao carregar
ru: Ошибка загрузки
tr: Yükleme Başarısız
uk: Не вдалося завантажити
vi: Tải thất bại
zh_hans: 加载失败
zh_hant: 加载失败

# error.user.aiConfiguration.message
source: %@ needs a valid %@ AI configuration before it can continue.
ar: يحتاج %@ إلى تكوين %@ صالح للذكاء الاصطناعي قبل المتابعة.
de: %@ benötigt eine gültige %@ KI-Konfiguration, um fortzufahren.
es: %@ necesita una configuración de IA válida de %@ para continuar.
fr: %@ nécessite une configuration IA %@ valide avant de pouvoir continuer.
id: %@ memerlukan konfigurasi AI %@ yang valid sebelum dapat melanjutkan.
it: %@ necessita di una configurazione AI %@ valida prima di poter continuare.
ja: %@ を続行するには、有効な %@ AI設定が必要です。
ko: %@이(가) 계속하려면 유효한 %@ AI 구성이 필요합니다.
nl: %@ heeft een geldige %@ AI-configuratie nodig voordat het verder kan.
pl: %@ wymaga prawidłowej konfiguracji AI %@, aby kontynuować.
pt_br: %@ precisa de uma configuração de IA %@ válida para continuar.
ru: %@ требуется корректная конфигурация %@ AI, чтобы продолжить.
tr: %@ devam edebilmek için geçerli bir %@ AI yapılandırmasına ihtiyaç duyuyor.
uk: %@ потребує дійсної конфігурації %@ AI, перш ніж продовжити.
vi: %@ cần cấu hình AI hợp lệ của %@ trước khi tiếp tục.
zh_hans: %@ 需要有效的 %@ AI 配置后才能继续。
zh_hant: %@ 需要有效的 %@ AI 配置后才能继续。

# error.user.aiConfiguration.recovery
source: Open Settings and check the provider Base URL, API Key, and model names.
ar: افتح الإعدادات وتحقق من عنوان URL الأساسي للمزود، ومفتاح API، وأسماء النماذج.
de: Öffnen Sie die Einstellungen und überprüfen Sie die Basis-URL des Anbieters, den API-Schlüssel und die Modellnamen.
es: Abre Ajustes y verifica la URL base del proveedor, la clave API y los nombres de los modelos.
fr: Ouvrez les réglages et vérifiez l'URL de base du fournisseur, la clé API et les noms de modèles.
id: Buka Pengaturan dan periksa URL Dasar penyedia, Kunci API, dan nama model.
it: Apri Impostazioni e controlla l'URL di base del provider, la chiave API e i nomi dei modelli.
ja: 設定を開き、プロバイダのベースURL、APIキー、モデル名を確認してください。
ko: 설정을 열고 제공자 기본 URL, API 키 및 모델 이름을 확인하세요.
nl: Open Instellingen en controleer de provider-Base-URL, API-sleutel en modelnamen.
pl: Otwórz Ustawienia i sprawdź adres URL dostawcy, klucz API oraz nazwy modeli.
pt_br: Abra os Ajustes e verifique a URL Base do provedor, a Chave de API e os nomes dos modelos.
ru: Откройте настройки и проверьте базовый URL провайдера, API-ключ и названия моделей.
tr: Ayarları açın ve sağlayıcı Temel URL'sini, API Anahtarını ve model adlarını kontrol edin.
uk: Відкрийте налаштування та перевірте базову URL-адресу постачальника, ключ API та назви моделей.
vi: Mở Cài đặt và kiểm tra Base URL, API Key và tên mô hình của nhà cung cấp.
zh_hans: 请打开设置，检查服务商 Base URL、API Key 和模型名称。
zh_hant: 请打开设置，检查服务商 Base URL、API Key 和模型名称。

# error.user.aiConfiguration.title
source: AI configuration needs attention
ar: تكوين الذكاء الاصطناعي يحتاج إلى اهتمام
de: KI-Konfiguration erfordert Aufmerksamkeit
es: La configuración de IA necesita atención
fr: La configuration IA nécessite votre attention
id: Konfigurasi AI perlu perhatian
it: La configurazione AI richiede attenzione
ja: AI設定に注意が必要です
ko: AI 구성에 주의가 필요합니다
nl: AI-configuratie vereist aandacht
pl: Konfiguracja AI wymaga uwagi
pt_br: A configuração de IA precisa de atenção
ru: Требуется внимание к конфигурации AI
tr: AI yapılandırması ilgi gerektiriyor
uk: Потрібна увага до конфігурації AI
vi: Cấu hình AI cần được chú ý
zh_hans: AI 配置需要检查
zh_hant: AI 配置需要检查

# error.user.aiProvider.message
source: %@ could not complete because %@ returned an unexpected response.
ar: تعذر على %@ الإكمال لأن %@ أعاد استجابة غير متوقعة.
de: %@ konnte nicht abgeschlossen werden, da %@ eine unerwartete Antwort zurückgegeben hat.
es: %@ no pudo completarse porque %@ devolvió una respuesta inesperada.
fr: %@ n'a pas pu être terminé car %@ a renvoyé une réponse inattendue.
id: %@ tidak dapat diselesaikan karena %@ mengembalikan respons yang tidak terduga.
it: %@ non ha potuto completare perché %@ ha restituito una risposta imprevista.
ja: %@ は %@ が予期しない応答を返したため完了できませんでした。
ko: %@이(가) %@에서 예상치 못한 응답을 반환하여 완료할 수 없습니다.
nl: %@ kon niet worden voltooid omdat %@ een onverwacht antwoord gaf.
pl: %@ nie mogło zostać ukończone, ponieważ %@ zwróciło nieoczekiwaną odpowiedź.
pt_br: %@ não pôde ser concluído porque %@ retornou uma resposta inesperada.
ru: %@ не удалось завершить, так как %@ вернул неожиданный ответ.
tr: %@ tamamlanamadı çünkü %@ beklenmeyen bir yanıt döndürdü.
uk: %@ не вдалося завершити, оскільки %@ повернув неочікувану відповідь.
vi: %@ không thể hoàn thành vì %@ trả về phản hồi không mong đợi.
zh_hans: %@ 未能完成，因为 %@ 返回了异常响应。
zh_hant: %@ 未能完成，因为 %@ 返回了异常响应。

# error.user.aiProvider.recovery
source: Try again later, or switch to another provider/model in AI Settings.
ar: حاول مرة أخرى لاحقًا، أو انتقل إلى مزود/نموذج آخر في إعدادات الذكاء الاصطناعي.
de: Versuchen Sie es später erneut oder wechseln Sie in den KI-Einstellungen zu einem anderen Anbieter/Modell.
es: Inténtalo de nuevo más tarde, o cambia a otro proveedor/modelo en Ajustes de IA.
fr: Réessayez plus tard, ou passez à un autre fournisseur/modèle dans les réglages IA.
id: Coba lagi nanti, atau beralih ke penyedia/model lain di Pengaturan AI.
it: Riprova più tardi o passa a un altro provider/modello nelle Impostazioni AI.
ja: 後でもう一度試すか、AI設定で別のプロバイダ/モデルに切り替えてください。
ko: 나중에 다시 시도하거나 AI 설정에서 다른 제공자/모델로 전환하세요.
nl: Probeer het later opnieuw of schakel over naar een andere provider/model in AI-instellingen.
pl: Spróbuj ponownie później lub przełącz na innego dostawcę/model w ustawieniach AI.
pt_br: Tente novamente mais tarde ou mude para outro provedor/modelo nos Ajustes de IA.
ru: Повторите попытку позже или переключитесь на другого провайдера/модель в настройках AI.
tr: Daha sonra tekrar deneyin veya AI Ayarları'nda başka bir sağlayıcı/modela geçin.
uk: Спробуйте пізніше або перемкніться на іншого постачальника/модель у налаштуваннях AI.
vi: Thử lại sau hoặc chuyển sang nhà cung cấp/mô hình khác trong Cài đặt AI.
zh_hans: 请稍后重试，或在 AI 设置中切换服务商/模型。
zh_hant: 请稍后重试，或在 AI 设置中切换服务商/模型。

# error.user.aiProvider.title
source: AI service did not respond correctly
ar: خدمة الذكاء الاصطناعي لم تستجب بشكل صحيح
de: KI-Dienst hat nicht korrekt geantwortet
es: El servicio de IA no respondió correctamente
fr: Le service IA n'a pas répondu correctement
id: Layanan AI tidak merespons dengan benar
it: Il servizio AI non ha risposto correttamente
ja: AIサービスが正しく応答しませんでした
ko: AI 서비스가 올바르게 응답하지 않았습니다
nl: AI-service reageerde niet correct
pl: Usługa AI nie odpowiedziała poprawnie
pt_br: O serviço de IA não respondeu corretamente
ru: AI-сервис ответил некорректно
tr: AI hizmeti doğru yanıt vermedi
uk: Служба AI відповіла неправильно
vi: Dịch vụ AI không phản hồi chính xác
zh_hans: AI 服务响应异常
zh_hant: AI 服务响应异常
